Конфигурация/AccumulationRegisters/Взаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Взаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУКТЗЕД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетАкцизнуюМарку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОП</Name>
					<Comment>Физическое лицо предприниматель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФОП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Штрихкоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/CommonModules/ПтмАпиРегистры/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьОстатки(Параметры) Экспорт

	Пагинация = ПтмАпи.ПараметрыПагинации(Параметры);
	OnlyNonZero = Истина;
	Если Параметры.Свойство("onlyNonZero") Тогда
		OnlyNonZero = ПтмАпи.БезопасноБулево(Параметры.onlyNonZero, Истина);
	КонецЕсли;

	Период = ТекущаяДатаСеанса();
	Если Параметры.Свойство("onDate") И ЗначениеЗаполнено(Параметры.onDate) Тогда
		Период = ПтмАпи.ДатаИзСтрокиISO(Строка(Параметры.onDate));
		Если НЕ ЗначениеЗаполнено(Период) Тогда
			Возврат ПтмАпи.ОшибкаUseCase("validation_error", "Invalid onDate");
		КонецЕсли;
	КонецЕсли;

	Склад = Неопределено;
	Номенклатура = Неопределено;
	Если Параметры.Свойство("warehouseId") И ЗначениеЗаполнено(Параметры.warehouseId) Тогда
		Склад = ПтмАпи.СсылкаПоИд(Справочники.Склады, Параметры.warehouseId);
	ИначеЕсли Параметры.Свойство("warehouseCode") И ЗначениеЗаполнено(Параметры.warehouseCode) Тогда
		Склад = Справочники.Склады.НайтиПоКоду(СокрЛП(Строка(Параметры.warehouseCode)));
	КонецЕсли;
	Если Параметры.Свойство("productId") И ЗначениеЗаполнено(Параметры.productId) Тогда
		Номенклатура = ПтмАпи.СсылкаПоИд(Справочники.Номенклатура, Параметры.productId);
	ИначеЕсли Параметры.Свойство("productCode") И ЗначениеЗаполнено(Параметры.productCode) Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду(СокрЛП(Строка(Параметры.productCode)));
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Склад КАК Склад,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваров.Остатки(&Период, ) КАК Остатки
	|ГДЕ
	|	(&Склад = НЕОПРЕДЕЛЕНО ИЛИ Остатки.Склад = &Склад)
	|	И (&Номенклатура = НЕОПРЕДЕЛЕНО ИЛИ Остатки.Номенклатура = &Номенклатура)
	|	И (&OnlyNonZero = ЛОЖЬ ИЛИ Остатки.КоличествоОстаток <> 0)";

	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("OnlyNonZero", OnlyNonZero);

	Все = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаДанных = Новый Структура;
		СтрокаДанных.Вставить("warehouseId", ПтмАпи.ИдСсылки(Выборка.Склад));
		СтрокаДанных.Вставить("warehouseCode", СокрЛП(Выборка.Склад.Код));
		СтрокаДанных.Вставить("productId", ПтмАпи.ИдСсылки(Выборка.Номенклатура));
		СтрокаДанных.Вставить("productCode", СокрЛП(Выборка.Номенклатура.Код));
		СтрокаДанных.Вставить("quantity", Выборка.Количество);
		СтрокаДанных.Вставить("onDate", Формат(Период, "ДФ=yyyy-MM-ddTHH:mm:ss"));
		Все.Добавить(СтрокаДанных);
	КонецЦикла;

	Возврат ПтмАпи.СтраницаСписка(Все, Пагинация.Limit, Пагинация.Offset);

КонецФункции

Функция ПолучитьПродажи(Параметры) Экспорт

	ПериодПров = ПтмАпи.РазобратьПериод(Параметры, Истина);
	Если ПериодПров.Ошибка Тогда
		Возврат ПтмАпи.ОшибкаUseCase(ПериодПров.КодОшибки, ПериодПров.Сообщение, ПериодПров.HttpКод);
	КонецЕсли;

	Пагинация = ПтмАпи.ПараметрыПагинации(Параметры);

	Номенклатура = Неопределено;
	Касса = Неопределено;
	Если Параметры.Свойство("productId") И ЗначениеЗаполнено(Параметры.productId) Тогда
		Номенклатура = ПтмАпи.СсылкаПоИд(Справочники.Номенклатура, Параметры.productId);
	ИначеЕсли Параметры.Свойство("productCode") И ЗначениеЗаполнено(Параметры.productCode) Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду(СокрЛП(Строка(Параметры.productCode)));
	КонецЕсли;
	Если Параметры.Свойство("cashRegisterId") И ЗначениеЗаполнено(Параметры.cashRegisterId) Тогда
		Касса = ПтмАпи.СсылкаПоИд(Справочники.Кассы, Параметры.cashRegisterId);
	ИначеЕсли Параметры.Свойство("cashRegisterCode") И ЗначениеЗаполнено(Параметры.cashRegisterCode) Тогда
		Касса = Справочники.Кассы.НайтиПоКоду(СокрЛП(Строка(Параметры.cashRegisterCode)));
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Обороты.Номенклатура КАК Номенклатура,
	|	Обороты.Касса КАК Касса,
	|	Обороты.КассоваяСмена КАК КассоваяСмена,
	|	Обороты.Сотрудник КАК Сотрудник,
	|	Обороты.КоличествоОборот КАК Количество,
	|	Обороты.СуммаОборот КАК Сумма,
	|	Обороты.СебестоимостьОборот КАК Себестоимость
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, , ) КАК Обороты
	|ГДЕ
	|	(&Номенклатура = НЕОПРЕДЕЛЕНО ИЛИ Обороты.Номенклатура = &Номенклатура)
	|	И (&Касса = НЕОПРЕДЕЛЕНО ИЛИ Обороты.Касса = &Касса)";

	Запрос.УстановитьПараметр("НачалоПериода", ПериодПров.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ПериодПров.ДатаОкончания);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Касса", Касса);

	Все = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаДанных = Новый Структура;
		СтрокаДанных.Вставить("productId", ПтмАпи.ИдСсылки(Выборка.Номенклатура));
		СтрокаДанных.Вставить("productCode", ?(ЗначениеЗаполнено(Выборка.Номенклатура), СокрЛП(Выборка.Номенклатура.Код), ""));
		СтрокаДанных.Вставить("cashRegisterId", ПтмАпи.ИдСсылки(Выборка.Касса));
		СтрокаДанных.Вставить("cashRegisterCode", ?(ЗначениеЗаполнено(Выборка.Касса), СокрЛП(Выборка.Касса.Код), ""));
		СтрокаДанных.Вставить("shiftId", ПтмАпи.ИдСсылки(Выборка.КассоваяСмена));
		СтрокаДанных.Вставить("employeeId", ПтмАпи.ИдСсылки(Выборка.Сотрудник));
		СтрокаДанных.Вставить("quantity", Выборка.Количество);
		СтрокаДанных.Вставить("amount", Выборка.Сумма);
		СтрокаДанных.Вставить("cost", Выборка.Себестоимость);
		СтрокаДанных.Вставить("period", Формат(ПериодПров.ДатаНачала, "ДФ=yyyy-MM-ddTHH:mm:ss"));
		Все.Добавить(СтрокаДанных);
	КонецЦикла;

	Возврат ПтмАпи.СтраницаСписка(Все, Пагинация.Limit, Пагинация.Offset);

КонецФункции

Функция ПолучитьДенежныеСредства(Параметры) Экспорт

	Пагинация = ПтмАпи.ПараметрыПагинации(Параметры);
	OnlyNonZero = Истина;
	Если Параметры.Свойство("onlyNonZero") Тогда
		OnlyNonZero = ПтмАпи.БезопасноБулево(Параметры.onlyNonZero, Истина);
	КонецЕсли;

	Период = ТекущаяДатаСеанса();
	Если Параметры.Свойство("onDate") И ЗначениеЗаполнено(Параметры.onDate) Тогда
		Период = ПтмАпи.ДатаИзСтрокиISO(Строка(Параметры.onDate));
	КонецЕсли;

	Касса = Неопределено;
	Если Параметры.Свойство("cashRegisterId") И ЗначениеЗаполнено(Параметры.cashRegisterId) Тогда
		Касса = ПтмАпи.СсылкаПоИд(Справочники.Кассы, Параметры.cashRegisterId);
	ИначеЕсли Параметры.Свойство("cashRegisterCode") И ЗначениеЗаполнено(Параметры.cashRegisterCode) Тогда
		Касса = Справочники.Кассы.НайтиПоКоду(СокрЛП(Строка(Параметры.cashRegisterCode)));
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Касса КАК Касса,
	|	Остатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(&Период, ) КАК Остатки
	|ГДЕ
	|	(&Касса = НЕОПРЕДЕЛЕНО ИЛИ Остатки.Касса = &Касса)
	|	И (&OnlyNonZero = ЛОЖЬ ИЛИ Остатки.СуммаОстаток <> 0)";

	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Касса", Касса);
	Запрос.УстановитьПараметр("OnlyNonZero", OnlyNonZero);

	Все = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаДанных = Новый Структура;
		СтрокаДанных.Вставить("cashRegisterId", ПтмАпи.ИдСсылки(Выборка.Касса));
		СтрокаДанных.Вставить("cashRegisterCode", ?(ЗначениеЗаполнено(Выборка.Касса), СокрЛП(Выборка.Касса.Код), ""));
		СтрокаДанных.Вставить("amount", Выборка.Сумма);
		СтрокаДанных.Вставить("onDate", Формат(Период, "ДФ=yyyy-MM-ddTHH:mm:ss"));
		Все.Добавить(СтрокаДанных);
	КонецЦикла;

	Возврат ПтмАпи.СтраницаСписка(Все, Пагинация.Limit, Пагинация.Offset);

КонецФункции

Функция ПолучитьВзаиморасчеты(Параметры) Экспорт

	Пагинация = ПтмАпи.ПараметрыПагинации(Параметры);
	OnlyNonZero = Истина;
	Если Параметры.Свойство("onlyNonZero") Тогда
		OnlyNonZero = ПтмАпи.БезопасноБулево(Параметры.onlyNonZero, Истина);
	КонецЕсли;

	Период = ТекущаяДатаСеанса();
	Если Параметры.Свойство("onDate") И ЗначениеЗаполнено(Параметры.onDate) Тогда
		Период = ПтмАпи.ДатаИзСтрокиISO(Строка(Параметры.onDate));
	КонецЕсли;

	Контрагент = Неопределено;
	Если Параметры.Свойство("counterpartyId") И ЗначениеЗаполнено(Параметры.counterpartyId) Тогда
		Контрагент = ПтмАпи.СсылкаПоИд(Справочники.Контрагенты, Параметры.counterpartyId);
	ИначеЕсли Параметры.Свойство("counterpartyCode") И ЗначениеЗаполнено(Параметры.counterpartyCode) Тогда
		Контрагент = Справочники.Контрагенты.НайтиПоКоду(СокрЛП(Строка(Параметры.counterpartyCode)));
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Контрагент КАК Контрагент,
	|	Остатки.ДокументРасчетов КАК ДокументРасчетов,
	|	Остатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(&Период, ) КАК Остатки
	|ГДЕ
	|	(&Контрагент = НЕОПРЕДЕЛЕНО ИЛИ Остатки.Контрагент = &Контрагент)
	|	И (&OnlyNonZero = ЛОЖЬ ИЛИ Остатки.СуммаОстаток <> 0)";

	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("OnlyNonZero", OnlyNonZero);

	Все = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаДанных = Новый Структура;
		СтрокаДанных.Вставить("counterpartyId", ПтмАпи.ИдСсылки(Выборка.Контрагент));
		СтрокаДанных.Вставить("counterpartyCode", ?(ЗначениеЗаполнено(Выборка.Контрагент), СокрЛП(Выборка.Контрагент.Код), ""));
		СтрокаДанных.Вставить("documentId", ПтмАпи.ИдСсылки(Выборка.ДокументРасчетов));
		СтрокаДанных.Вставить("amount", Выборка.Сумма);
		СтрокаДанных.Вставить("onDate", Формат(Период, "ДФ=yyyy-MM-ddTHH:mm:ss"));
		Все.Добавить(СтрокаДанных);
	КонецЦикла;

	Возврат ПтмАпи.СтраницаСписка(Все, Пагинация.Limit, Пагинация.Offset);

КонецФункции

Функция ПолучитьШтрихкоды(Параметры) Экспорт

	Пагинация = ПтмАпи.ПараметрыПагинации(Параметры);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Штрихкоды.Штрихкод КАК Штрихкод,
	|	Штрихкоды.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	(&Штрихкод = """" ИЛИ Штрихкоды.Штрихкод = &Штрихкод)
	|	И (&Номенклатура = НЕОПРЕДЕЛЕНО ИЛИ Штрихкоды.Номенклатура = &Номенклатура)";

	Штрихкод = "";
	Номенклатура = Неопределено;
	Если Параметры.Свойство("barcode") И ЗначениеЗаполнено(Параметры.barcode) Тогда
		Штрихкод = СокрЛП(Строка(Параметры.barcode));
	КонецЕсли;
	Если Параметры.Свойство("productId") И ЗначениеЗаполнено(Параметры.productId) Тогда
		Номенклатура = ПтмАпи.СсылкаПоИд(Справочники.Номенклатура, Параметры.productId);
	ИначеЕсли Параметры.Свойство("productCode") И ЗначениеЗаполнено(Параметры.productCode) Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду(СокрЛП(Строка(Параметры.productCode)));
	КонецЕсли;

	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

	Все = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаДанных = Новый Структура;
		СтрокаДанных.Вставить("barcode", СокрЛП(Выборка.Штрихкод));
		СтрокаДанных.Вставить("productId", ПтмАпи.ИдСсылки(Выборка.Номенклатура));
		СтрокаДанных.Вставить("productCode", ?(ЗначениеЗаполнено(Выборка.Номенклатура), СокрЛП(Выборка.Номенклатура.Код), ""));
		СтрокаДанных.Вставить("productName", ?(ЗначениеЗаполнено(Выборка.Номенклатура), СокрЛП(Выборка.Номенклатура.Наименование), ""));
		Все.Добавить(СтрокаДанных);
	КонецЦикла;

	Возврат ПтмАпи.СтраницаСписка(Все, Пагинация.Limit, Пагинация.Offset);

КонецФункции

Функция ПолучитьЦены(Параметры) Экспорт

	Пагинация = ПтмАпи.ПараметрыПагинации(Параметры);

	// history mode if both dates present
	ПериодПров = ПтмАпи.РазобратьПериод(Параметры, Ложь);
	Если ПериодПров.Ошибка Тогда
		Возврат ПтмАпи.ОшибкаUseCase(ПериодПров.КодОшибки, ПериодПров.Сообщение, ПериодПров.HttpКод);
	КонецЕсли;

	Номенклатура = Неопределено;
	ТипЦен = Неопределено;
	Если Параметры.Свойство("productId") И ЗначениеЗаполнено(Параметры.productId) Тогда
		Номенклатура = ПтмАпи.СсылкаПоИд(Справочники.Номенклатура, Параметры.productId);
	ИначеЕсли Параметры.Свойство("productCode") И ЗначениеЗаполнено(Параметры.productCode) Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду(СокрЛП(Строка(Параметры.productCode)));
	КонецЕсли;
	Если Параметры.Свойство("priceTypeId") И ЗначениеЗаполнено(Параметры.priceTypeId) Тогда
		ТипЦен = ПтмАпи.СсылкаПоИд(Справочники.ТипыЦен, Параметры.priceTypeId);
	ИначеЕсли Параметры.Свойство("priceTypeCode") И ЗначениеЗаполнено(Параметры.priceTypeCode) Тогда
		ТипЦен = Справочники.ТипыЦен.НайтиПоКоду(СокрЛП(Строка(Параметры.priceTypeCode)));
	КонецЕсли;

	Все = Новый Массив;

	Если ЗначениеЗаполнено(ПериодПров.ДатаНачала) Тогда
		// history
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Цены.Период КАК Период,
		|	Цены.Номенклатура КАК Номенклатура,
		|	Цены.ТипЦен КАК ТипЦен,
		|	Цены.Цена КАК Цена,
		|	Цены.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры КАК Цены
		|ГДЕ
		|	Цены.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (&Номенклатура = НЕОПРЕДЕЛЕНО ИЛИ Цены.Номенклатура = &Номенклатура)
		|	И (&ТипЦен = НЕОПРЕДЕЛЕНО ИЛИ Цены.ТипЦен = &ТипЦен)";
		Запрос.УстановитьПараметр("НачалоПериода", ПериодПров.ДатаНачала);
		Запрос.УстановитьПараметр("КонецПериода", ПериодПров.ДатаОкончания);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Все.Добавить(СтрокаЦены(Выборка));
		КонецЦикла;
	Иначе
		// slice last
		OnDate = ТекущаяДатаСеанса();
		Если Параметры.Свойство("onDate") И ЗначениеЗаполнено(Параметры.onDate) Тогда
			OnDate = ПтмАпи.ДатаИзСтрокиISO(Строка(Параметры.onDate));
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Срез.Период КАК Период,
		|	Срез.Номенклатура КАК Номенклатура,
		|	Срез.ТипЦен КАК ТипЦен,
		|	Срез.Цена КАК Цена,
		|	Срез.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, ) КАК Срез
		|ГДЕ
		|	(&Номенклатура = НЕОПРЕДЕЛЕНО ИЛИ Срез.Номенклатура = &Номенклатура)
		|	И (&ТипЦен = НЕОПРЕДЕЛЕНО ИЛИ Срез.ТипЦен = &ТипЦен)";
		Запрос.УстановитьПараметр("Период", OnDate);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Все.Добавить(СтрокаЦены(Выборка));
		КонецЦикла;
	КонецЕсли;

	Возврат ПтмАпи.СтраницаСписка(Все, Пагинация.Limit, Пагинация.Offset);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтрокаЦены(Выборка)

	СтрокаДанных = Новый Структура;
	СтрокаДанных.Вставить("productId", ПтмАпи.ИдСсылки(Выборка.Номенклатура));
	СтрокаДанных.Вставить("productCode", ?(ЗначениеЗаполнено(Выборка.Номенклатура), СокрЛП(Выборка.Номенклатура.Код), ""));
	СтрокаДанных.Вставить("priceTypeId", ПтмАпи.ИдСсылки(Выборка.ТипЦен));
	СтрокаДанных.Вставить("priceTypeCode", ?(ЗначениеЗаполнено(Выборка.ТипЦен), СокрЛП(Выборка.ТипЦен.Код), ""));
	СтрокаДанных.Вставить("price", Выборка.Цена);
	СтрокаДанных.Вставить("period", Формат(Выборка.Период, "ДФ=yyyy-MM-ddTHH:mm:ss"));
	СтрокаДанных.Вставить("recorderId", ПтмАпи.ИдСсылки(Выборка.Регистратор));
	Возврат СтрокаДанных;

КонецФункции

#КонецОбласти
